

第一步，取1个 url

第二步，判断 url 是否已经抓取过





# github.com/nttech/nttech.github.io.git
# github.com/nttech/nttech.github.io.git


git config --global http.proxy 10.43.146.29:8080
git config --global https.proxy 10.43.146.29:8080


# 参考链接

# http://lxml.de/api/lxml.cssselect-pysrc.html


# 参考，天猫，描述图片

# https://desc.alicdn.com/i2/130/710/13371072438/TB18hcHKXXXXXbzXVXX8qtpFXlX.desc%7Cvar%5Edesc%3Bsign%5E3c583fe1ae72146a31516233853bc4f1%3Blang%5Egbk%3Bt%5E1461227321


# 输入：origin_name，seed_url

# 逻辑：

# 输入是配置在xml里的

# 程序，是一个定时执行的程序，每次遍历 xml 每一个 item

# 首先检查 item 的 origin_name 获取 origin_id

# 如果存在 origin_id ，则说明曾经抓取过，则从 post_m 取出抓取的最新的一个，页面，继续抓取 ...

# 如果不存在 origin_id，则说明1次都还没抓取过，则使用 xml 的 seed_url，去抓取

# ------------

# 可能遇到的问题：origin_id 已经抓去过，但是最新抓取的页面中，已经不包含需要提取的 next_page_url 了

# 这时候，

# /*
	# 重要：有任何想法，建议，大家积极补充。

	# 此文档的主要作用，是用来搜集原始信息来源。
	# 原始信息来源，
	# （1）有的只抓取1次，即1个URL抓1次，以后就再也不需要了。
	# （2）有的是通过1个种子URL抓取之后，然后通过类似，上一篇，下一篇，提取这个超级链接，自动抓取上一篇，下一篇
	# （3）有的是比如1个列表，可能此网站的编辑，昨天夜里发表了一篇文章，然后在这个列表显示出来了，
	# 这时候，我们的软件，要主动抓取这篇文章
# */

# 参考：原始数据源 站点 搜集 excel

# 通过，友情链接，蜘蛛去发现，更多的网站 ？

# 站点：

# 主题：

# 要把，发现订阅主题，发现站点的，功能，放在最显著的位置，最快捷，方便的位置

# 种植业、林业、畜牧业、渔业和副业

# 顶部栏目标签：推荐，热门，种植，养殖，水产，市场

# （1）种植业
# （2）畜牧业
# （3）水产业



# 不定期，做一些系列，做一些总结，比如，农药全面介绍，病虫害全面介绍，等等

# 1，通过微信分享文章，
# 2，用户点击文章，自动识别用户是否，已经下载app，没有下载，使用宣传语，新农业，汇聚致富，吸引用户，
# 已经下载，是否注册，

# 抓取用户手机号码，没有手机号，其他唯一标识？ 对未注册用户，进行，行为跟踪统计

# （1）图片，样式的处理？


























